from typing import List

from models.base import BaseModel
from pydantic import Field


class BaseRequest(BaseModel):

    from_: str = Field(
        "01/30/2023 20:00:00",
        description='С какого дня'
    )
    to_: str = Field(
        "09/30/2023 20:00:00",
        description='По какой день'
    )
    wells: List[dict] = Field(
        [
            {"Скважина ЛА-554 ": ["06/24/2023 18:00:00", "06/28/2023 10:00:00"]},
            {"Скважина ЛА-522": ["02/14/2023 10:00:00", "02/15/2023 12:30:00"]},
            {"Скважина ЛА-529 ": ["06/28/2023 18:00:00", "07/01/2023 20:00:00"]},
            {"Скважина ЛА-508": ["06/26/2023 18:00:00", "07/02/2023 20:00:00"]},
            {"Скважина ЛА-504": ["02/04/2023 12:00:00", "02/04/2023 21:00:00"]},
            {"Скважина ЛА-524": ["06/23/2023 18:00:00", "07/05/2023 10:00:00"]},
            {"Скважина ЛА-521": ["02/13/2023 12:00:00", "02/14/2023 02:00:00"]},
            {"Скважина ЛА-528": ["06/27/2023 18:00:00", "07/05/2023 08:00:00"]},
            {"Скважина ЛА-503": ["02/19/2023 18:00:00", "02/20/2023 18:16:00"]},
            {"Скважина ЛА-517": ["02/21/2023 18:00:00", "02/22/2023 19:00:00"]},
            {"Скважина ЛА-506": ["03/07/2023 18:00:00", "03/10/2023 19:00:00"]},
        ],
        description='Список словарей со скважинами'
    )
    tl_name: str = Field(
        "ТЛ1 Сепаратор ",
        description='ТЛ Имя'
    )
    mapping_index: int = Field(
        0,
        description='Индекс'
    )


class BaseResponse(BaseModel):
    success: bool = Field(..., description='Успех?')
    message: List[str] = Field(default_factory=list,
                               description='Сообщения расчета')


class SolutionResponse(BaseResponse):
    solution: dict = Field({}, description='Решение расчета')
